{
  "intents": [
    {
      "tag": "Greetings",
      "patterns": [
        "Hello",
        "Hi",
        "Hey",
        "Hi there",
        "Good morning",
        "Good evening",
        "Mukomere",
        "Mambo",
        "Bonjour",
        "Hola",
        "Namaste",
        "Salam"
      ],
      "responses": [
        "Hello am kaberege, How can I help you?",
        "hello! how are you doing?",
        "hi, pleasure to be of service",
        "hi, how can I help you?"
      ]
    },
    {
      "tag": "Endings",
      "patterns": [
        "Thank you",
        "Thanks",
        "Thanks a lot",
        "Cheers",
        "bye",
        "Goodbye",
        "Farewell",
        "See you",
        "See you later",
        "Murakoze",
        "Asante",
        "Toda"
      ],
      "responses": [
        "its a pleasure to be at your service!",
        "you are welcome!",
        "feel free to come again anytime please!",
        "Anytime!",
        "happy to help!"
      ]
    },

    {
      "tag": "umucyo_exploration",
      "patterns": [
        "What are the requirements to access the Umucyo system?",
        "What do I need to have in order to use the Umucyo system?",
        "Can you list the prerequisites for accessing the Umucyo system?",
        "What hardware and software do I need to access Umucyo?",
        "What is required in terms of technology to use Umucyo?",
        "Can you tell me the technical requirements for Umucyo access?",
        "How do I make sure my computer is compatible with Umucyo?"
      ],
      "responses": [
        "To access the Umucyo system, you need a computer system with a minimum of Pentium IV configuration or higher, an internet connection, and a Windows operating system. You also need a modern web browser such as Chrome, Firefox, or Internet Explorer. The system may allow you to view pages, but full functionality including login and digital signature may not work as intended on older or incompatible systems.",
        "The technical requirements for using Umucyo are a computer with Pentium IV or higher configuration, Windows operating system, an active internet connection, and a web browser such as Chrome, Firefox, or Internet Explorer. Ensure your system meets these specifications to enjoy full functionality of the platform.",
        "Accessing Umucyo requires a computer with a minimum of Pentium IV configuration and a Windows operating system. You must also have an internet connection and a web browser like Chrome, Firefox, or Internet Explorer. These are the basic requirements for using the system and ensuring full compatibility.",
        "To ensure seamless use of the Umucyo system, make sure your computer has at least a Pentium IV configuration, is running a Windows operating system, and has an active internet connection. You will also need a modern web browser such as Chrome, Firefox, or Internet Explorer for optimal performance."
      ]
    },
    {
      "tag": "registration",
      "patterns": [
      "How do I register on the Umucyo e-Procurement Portal?",
      "What is the process for registering on Umucyo?",
      "How can I become a registered user on Umucyo?",
      "What are the steps to get registered on Umucyo?",
      "Can you walk me through the registration process for Umucyo?",
      "What is required for me to register on Umucyo?"
      ],
      "responses": [
      "The process for registering on the Umucyo e-Procurement Portal is simple. First, go to the Umucyo website and click on the supplier registration link. Fill out the online registration form, making sure to possess a digital certificate and browse to it when the system requests it. Upon successful submission and approval by the Umucyo registration administrator, you will be able to log in using your registered certificate. If you need assistance, you can call their toll-free number for support.",
      "To become a registered user on Umucyo, follow these steps: 1) Go to the Umucyo website, 2) Click on the supplier registration link, 3) Fill out the online registration form, 4) Possess a digital certificate and browse to it when prompted, 5) Wait for approval from the Umucyo registration administrator, 6) Use your registered certificate to log in. If you need help, call the Umucyo toll-free number for support.",
      "To register on Umucyo, you need to: 1) Visit the Umucyo website, 2) Click on the supplier registration link, 3) Fill out the online registration form, 4) Have a digital certificate ready and browse to it when prompted, 5) Wait for approval from the Umucyo registration administrator, 6) Use your registered certificate to log in. If you need assistance, call the Umucyo toll-free number for support."
      ]
      },
      {
            "tag": "registration",
            "patterns": [
              "How do I get registered on the Umucyo e-Procurement Portal?",
              "Can you explain the registration process for Umucyo e-Procurement Portal?",
              "What are the steps to register on Umucyo e-Procurement Portal?",
              "How can I become a registered supplier on Umucyo e-Procurement Portal?",
              "What do I need to do to register on Umucyo e-Procurement Portal?",
              "How do I start the process of registering as a supplier on Umucyo e-Procurement Portal?"
            ],
            "responses": [
              "To register on the Umucyo e-Procurement Portal, follow these steps: \n1. Go to the Umucyo homepage at umucyo.gov.rw. \n2. Click on the Supplier Registration link. \n3. Fill out the online registration form. \n4. You will need to possess a digital certificate, which you will be asked to browse to during the registration process. \n5. Submit the registration form and wait for approval from the Umucyo registration administrator. \n6. Once approved, you can use your registered certificate to log in. \n7. As a final step, you will need to register your user and map it with the digital certificate obtained from GovCA. \nIf you need assistance, you can call the toll-free number 3131 for support.",
              "Umucyo e-Procurement Portal is a platform for suppliers to register and participate in procurement processes. To become a registered supplier, you need to follow these steps: \n1. Go to the Umucyo homepage at umucyo.gov.rw. \n2. Click on the Supplier Registration link. \n3. Fill out the online registration form. \n4. You will need to possess a digital certificate, which you will be asked to browse to during the registration process. \n5. Submit the registration form and wait for approval from the Umucyo registration administrator. \n6. Once approved, you can use your registered certificate to log in. \n7. As a final step, you will need to register your user and map it with the digital certificate obtained from GovCA. \nIf you need assistance, you can call the toll-free number 3131 for support."
            ]
          },
      
      {
      "intents": [{
      "tag": "registration",
      "patterns": [
      "How do I register on the Umucyo e-Procurement Portal?",
      "What steps do I need to follow to register on Umucyo e-Procurement Portal?",
      "Can you explain the process of registering on Umucyo e-Procurement Portal?",
      "I want to register as a supplier on Umucyo e-Procurement Portal, what should I do?",
      "What do I need to do to become a registered supplier on Umucyo e-Procurement Portal?",
      "Tell me about Umucyo e-Procurement Portal",
      "What is Umucyo e-Procurement Portal?"
      ],
      "responses": [
      "To register as a supplier on Umucyo e-Procurement Portal, you need to follow these steps: \n\n1. Go to the Umucyo e-Procurement Portal website (umucyo.gov.rw). \n2. Click on the Supplier Registration link. \n3. Fill out the registration form online. \n4. You will need a digital certificate, which you can obtain from GovCA. \n5. When asked, browse to your digital certificate. \n6. Submit the form and wait for approval from the registration administrator at Umucyo. \n7. Once approved, you can use your registered certificate to log in. \n\nFor any support, you can call the toll-free number 3131, and the support team will assist you with the registration process."
      ]
      },
    
      
      {
      "tag": "registration",
      "patterns": [
      "How do I get registered on Umucyo e-Procurement Portal?",
      "What's the process of registering on Umucyo e-Procurement Portal?",
      "Can you guide me through the registration process on Umucyo e-Procurement Portal?",
      "How can I become a registered supplier on Umucyo e-Procurement Portal?"
      ],
      "responses": [
      "To register on Umucyo e-Procurement Portal as a supplier, follow these steps:1. Go to umucyo.gov.rw homepage. 2. Click on the supplier registration link.3. Fill out the online registration form.4. You will need to have a digital certificate which you will be prompted to browse to when the system asks for it.5. Once you submit the form, it will be reviewed and approved by the Umucyo registration administrator.6. Upon approval, you can use your registered certificate to log in,7. As a supplier, you will need to register your user and map it with the digital certificate obtained from GovCA.If you need assistance, please call our toll-free number 3131 and we will be happy to help."
      ]
      },
      {
      "tag": "documentations",
      "patterns": [
        "How can I obtain a digital certificate?  and what are the requirements??",
      
      "Where do you get college writing essay?",
        "What is the link to the college writing essay?",
        "How do you get college writing essay?",
        "Who is in Charge of college writing essay?"
      ],
      "responses": [
        "Visit www.govca.rw then apply for Digital certificate for e-procurement system."
      ]
    },
    {
      "tag": "tender_submission",
      "patterns": [
        "How do I submit a tender through?  the system UMUCYO?",
        "Where do you get how do i make my essay look longer?",
        "What is the link to the how do i make my essay look longer?",
        "How do you get how do i make my essay look longer?",
        "Who is in Charge of how do i make my essay look longer?"
      ],
      "responses": [
        "Go to “Help→ Admin. Announcement “and download bid submission use guide"
      ]
    },
    {
      "tag": "tender",
      "patterns": [
        "How to see opened tenders??",
        "Where do you get Home?",
        "What is the link to the Home?",
        "How do you get Home?",
        "Who is in Charge of Home?"
      ],
      "responses": [
        "1) Click on “e-Bidding menu”2) List of advertising3) Choose the tender name and click on “Planned open date” column title to view the opening report"
      ]
    },
    {
      "tag": "About_RPPA",
      "patterns": [
        "Guide me to About RPPA?",
        "Where do you get About RPPA?",
        "What is the link to the About RPPA?",
        "How do you get About RPPA?",
        "Who is in Charge of About RPPA?"
      ],
      "responses": [
        "You can use this link https://www.rppa.gov.rw/ for more information"
      ]
    },
    {
   
"tag": "ACESS_umucyo",
"patterns": [
"How can I use UMUCYO system?",
"What are the steps to access UMUCYO e-Procurement system?",
"How do I start using UMUCYO e-Procurement portal?",
"What is the process to use UMUCYO e-Procurement system?",
"Can you explain the procedure to access UMUCYO system?"
],
"responses": [
"You can access UMUCYO e-Procurement system by visiting www.umucyo.gov.rw. To help understand how to use the system, you can also check out the Help Menu for user guides.",
"To use the UMUCYO e-Procurement portal, simply go to www.umucyo.gov.rw. You can also refer to the Help Menu for more information on how to use the system.",
"The first step to accessing the UMUCYO e-Procurement system is to visit the website at www.umucyo.gov.rw. You may find more information and support on how to use the system in the Help Menu."
]
},
    {
      "tag": "RPPA",
      "patterns": [
        "Guide me to RPPA ?",
        "Where do you get RPPA Functions?",
        "What is the link to the RPPA Functions?",
        "How do you get RPPA Functions?",
        "Who is in Charge of RPPA Functions?"
      ],
      "responses": [
        "You can use this link https://www.rppa.gov.rw/ for more information"
      ]
    },
    {
      "tag": "RRPA Mission_Vision and Values",
      "patterns": [
        "Guide me to RPPA ?",
        "Where do you get RPPA Mission, Vision and Values?",
        "What is the link to the RPPA Mission, Vision and Values?",
        "How do you get RPPA Mission, Vision and Values?",
        "Who is in Charge of RPPA Mission, Vision and Values?"
      ],
      "responses": [
        "You can use this link  https://www.rppa.gov.rw/ for more information"
      ]
    },
    {
      "tag": "RPPA Law and Related Orders",
      "patterns": [
        "Guide me to RURA Law and Related Orders?",
        "Where do you get RURA Law and Related Orders?",
        "What is the link to the RURA Law and Related Orders?",
        "How do you get RURA Law and Related Orders?",
        "Who is in Charge of RURA Law and Related Orders?"
      ],
      "responses": [
        "You can use this link  https://www.rppa.gov.rw/ for more information"
      ]
    },
    {
      "tag": "Regional and International Partnerships",
      "patterns": [
        " What are the steps to change Categories of the Companies in Public procurement?",
        "Where do you get Regional and International Partnerships?",
        "What is the link to the Regional and International Partnerships?",
        "How do you get Regional and International Partnerships?",
        "Who is in Charge of Regional and International Partnerships?"
      ],
      "responses": [
        "You can use this link https://www.rrpa.gov for more information"
      ]
    },
    {
      "tag": "about RPPA",
      "patterns": [
      "What does RPPA do?",
      "What is the role of RPPA?",
      "What is the function of RPPA?",
      "What is the purpose of RPPA?",
      "Can you tell me about RPPA?"
      ],
      "responses": [
      "The Rwanda Public Procurement Authority (RPPA) is a government agency responsible for managing the procurement process in a fair, transparent, and competitive manner. The RPPA ensures that public procurement is conducted in accordance with the law and regulations, and provides support and guidance to its clients and stakeholders.",
      "RPPA is responsible for ensuring that public procurement is carried out in a manner that is consistent with the principles of fairness, transparency, and competition, and is committed to promoting good governance and accountability in procurement practices."
      ]
      },
    {
      "tag": "RPPA services",
      "patterns": [
        "illustrate more RPPA services ?"
        
      ],
      "responses": [
        "RPPA stands for Rwanda Public Procurement Authority, which is responsible for providing procurement services to the government of Rwanda. Their services include procurement planning, contract management, supplier management, and performance evaluation, among others.You can use this link  href info@rppa.gov.rw ,or Toll free:3131  for more informations"
      ]
    },
    {
      "tag": "Consumer Rights and Obligations",
      "patterns": [
        "Guide me to Consumer Rights and Obligations?",
        "Where do you get Consumer Rights and Obligations?",
        "What is the link to the Consumer Rights and Obligations?",
        "How do you get Consumer Rights and Obligations?",
        "Who is in Charge of Consumer Rights and Obligations?"
      ],
      "responses": [
        "You can use this link You can use this link  href info@rppa.gov.rw ,or Toll free:3131  for more informations for more information"
      ]
    },
    {
      "tag": "Complaints Handling Procedures",
      "patterns": [
        "Guide me to Complaints Handling Procedures?",
        "Where do you get Complaints Handling Procedures?",
        "What is the link to the Complaints Handling Procedures?",
        "How do you get Complaints Handling Procedures?",
        "Who is in Charge of Complaints Handling Procedures?"
      ],
      "responses": [
        "You can use this link You can use this link  href info@rppa.gov.rw ,or Toll free:3131  for more informations for more information"
      ]
    },
    {
      "tag": "Consumer Awareness and Educational tools",
      "patterns": [
        "Guide me to Consumer Awareness and Educational tools?",
        "Where do you get Consumer Awareness and Educational tools?",
        "What is the link to the Consumer Awareness and Educational tools?",
        "How do you get Consumer Awareness and Educational tools?",
        "Who is in Charge of Consumer Awareness and Educational tools?"
      ],
      "responses": [
        "You can use this link You can use this link  href info@rppa.gov.rw ,or Toll free:3131  for more informations for more information"
      ]
    },
    {
      "tag": "Laws and Regulations",
      "patterns": [
        "Guide me to Laws and Regulations?",
        "Where do you get Laws and Regulations?",
        "What is the link to the Laws and Regulations?",
        "How do you get Laws and Regulations?",
        "Who is in Charge of Laws and Regulations?"
      ],
      "responses": [
        "You can use this link You can use this link  href info@rppa.gov.rw ,or Toll free:3131  for more informations for more information"
      ]
    },
    {
      "tag": "Strategic Plan 2022-2027",
      "patterns": [
        "Guide me to Strategic Plan 2022-2027?",
        "Where do you get Strategic Plan 2022-2027?",
        "What is the link to the Strategic Plan 2022-2027?",
        "How do you get Strategic Plan 2022-2027?",
        "Who is in Charge of Strategic Plan 2022-2027?"
      ],
      "responses": [
        "You can use this link You can use this link  href info@rppa.gov.rw ,or Toll free:3131  for more informations for more information"
      ]
    },
    {
      "tag": "Service Charter",
      "patterns": [
        "Guide me to Service Charter?",
        "Where do you get Service Charter?",
        "What is the link to the Service Charter?",
        "How do you get Service Charter?",
        "Who is in Charge of Service Charter?"
      ],
      "responses": [
        "You can use this link You can use this link a<href= https://www.info@rppa.gov.rw / ,or Toll free:3131 for more information"
      ]
    },
    {
      "tag": "FAQs",
      "patterns": [
        "Guide me to FAQs?",
        "Where do you get FAQs?",
        "What is the link to the FAQs?",
        "How do you get FAQs?",
        "Who is in Charge of FAQs?"
      ],
      "responses": [
        "You can use this link https://www.rppa.gov.rw/faqs for more information"
      ]
    },
    {
      "tag": "updates",
      "patterns": [
        "Guide me to RPPA updates?",
        "Where do you get RPPA Updates?",
        "What is the link to the RPPA updates?",
        "How do you get RPPA updates?",
        "Who is in Charge of RPPA updates?"
      ],
      "responses": [
        "You can use this link https://www.rppa.gov.rw/updates/announcement for more information"
      ]
    },
    {
      "tag": "Overview",
      "patterns": [
        "Guide me to Overview?",
        "Where do you get Overview?",
        "What is the link to the Overview?",
        "How do you get Overview?",
        "Who is in Charge of Overview?"
      ],
      "responses": [
        "You can use this link https://www.info@rppa.gov.rw ,or Toll free:3131 for more information"
      ]
    },
    {
      "tag": "Sub-Sectors and Services",
      "patterns": [
        "Guide me to Sub-Sectors and RPPA Services?",
        "Where do you get Sub-Sectors and RPPA Services?",
        "What is the link to the Sub-Sectors and RPPA Services?",
        "How do you get Sub-Sectors and RPPA Services?",
        "Who is in Charge of Sub-Sectors and RPPA Services?"
      ],
      "responses": [
        "You can use this link https://www.rppa.gov.rw/services ,or Toll free:3131 for more information"
      ]
    },
    {
      "tag": "RPPA Resources Management and Monitoring",
      "patterns": [
        "Guide me to RPPA Scarce Resources Management and Monitoring?",
        "Where do you get RPPA Scarce Resources Management and Monitoring?",
        "What is the link to the RPPA Scarce Resources Management and Monitoring?",
        "How do you get RPPA Scarce Resources Management and Monitoring?",
        "Who is in Charge oF RPPA Scarce Resources Management and Monitoring?"
      ],
      "responses": [
        "You can use this link  https://www.info@rppa.gov.rw ,or Toll free:3131 for more information"
      ]
    },
    {
      "tag": "RPPA Standards and Quality of Service",
      "patterns": [
        "Guide me to RPPA Standards and Quality of Service?",
        "Where do you get RPPA Standards and Quality of Service?",
        "What is the link to the RPPA Standards and Quality of Service?",
        "How do you get RPPA Standards and Quality of Service?",
        "Who is in Charge of RPPA Standards and Quality of Service?"
      ],
      "responses": [
        "You can use this link https://www.info@rppa.gov.rw ,or Toll free:3131 for more information"
      ]
    },
   
     { "tag": "RPPA Media Regulation",
      "patterns": [
        "How does the RPPA regulate public procurement in Rwanda?",
        "Where do you get ICT Media Regulation?",
        "What is the link to the ICT Media Regulation?",
        "How do you get ICT Media Regulation?",
        "Who is in Charge of ICT Media Regulation?"
      ],
      "responses": [
        "You can use this link https://www.info@rppa.gov.rw ,or Toll free:3131 for more information"
      ]
    },
    {
      "tag": "Regulatory Instruments",
      "patterns": [
        "Guide me to Regulatory Instruments?",
        "Where do you get Regulatory Instruments?",
        "What is the link to the Regulatory Instruments?",
        "How do you get Regulatory Instruments?",
        "Who is in Charge of Regulatory Instruments?"
      ],
      "responses": ["You can use this link https://www.info@rppa.gov.rw ,or Toll free:3131 for more information"
      ]
    },
    {
      "tag": "Laws and Orders",
      "patterns": [
        "Guide me to Laws and Orders?",
        "Where do you get Laws and Orders?",
        "What is the link to the Laws and Orders?",
        "How do you get Laws and Orders?",
        "Who is in Charge of Laws and Orders?"
      ],
      "responses": ["You can use this link https://www.info@rppa.gov.rw ,or Toll free:3131 for more information"
      ]
    },
    {
      "tag": "Regulations and Guidelines",
      "patterns": [
        "Guide me to Regulations and Guidelines?",
        "Where do you get Regulations and Guidelines?",
        "What is the link to the Regulations and Guidelines?",
        "How do you get Regulations and Guidelines?",
        "Who is in Charge of Regulations and Guidelines?"
      ],
      "responses": ["You can use this link https://www.info@rppa.gov.rw ,or Toll free:3131 for more information"
      ]
    },
    {
      "tag": "Board Decisions",
      "patterns": [
        "Guide me to Board Decisions?",
        "Where do you get Board Decisions?",
        "What is the link to the Board Decisions?",
        "How do you get Board Decisions?",
        "Who is in Charge of Board Decisions?"
      ],
      "responses": [
        "You can use this link https://www.info@rppa.gov.rw ,or Toll free:3131 for more information"
      ]
    },
    {
      "tag": "PROCUREMENT_PROCESS",
      "patterns": [
        "Can you explain the procurement process overseen by the RPPA?",
        "Where do you get Other documents?",
        "What is the link to the Other documents?",
        "How do you get Other documents?",
        "Who is in Charge of Other documents?"
      ],
      "responses": [
        "You can use this link https://www.info@rppa.gov.rw ,or Toll free:3131 for more information"
      ]
    },
    {
      "tag": "transiparency",
      "patterns": [
        "What measures does the RPPA have in place to ensure transparency in public procurement?",
        "Where do you get Statistics?",
        "What is the link to the Statistics?",
        "How do you get Statistics?",
        "Who is in Charge of Statistics?"
      ],
      "responses": [
        "The establishment, maintenance and improvement of sound public procurement systems are critical responsibilities of governments throughout the world."
      ]
    },
    {
      "tag": "Rwanda ON-line E-Procurement System",
      "patterns": [
        "Can you describe the steps for registering as a supplier with the RPPA",
        "Where do you get Monthly Publication?",
        "What is the link to the Monthly Publication?",
        "How do you get Monthly Publication?",
        "Who is in Charge of Monthly Publication?"
      ],
      "responses": [
        "By registering on www.umucyo.rw, you agree to be bound by all commercial and electronic laws and regulations in force in Rwanda, especially the following"
      ]
    },
    {
      "tag": "Complaints Handling Procedures",
      "patterns": [
        "How does the RPPA handle complaints or disputes related to public procurement?",
        "Where do you get Quarterly publication?",
        "What is the link to the Quarterly publication?",
        "How do you get Quarterly publication?",
        "Who is in Charge of Quarterly publication?"
      ],
      "responses": [
        "The establishment, maintenance and improvement of sound public procurement systems are critical responsibilities of governments throughout the world or visit Services - RPPAhttps://www.rppa.gov.rw ."
      ]
    },
    {
      "tag": "local promotion",
      "patterns": [
        "What is the role of the RPPA in promoting local content in public procurement?",
        "Where do you get Sector Reports?",
        "What is the link to the Sector Reports?",
        "How do you get Sector Reports?",
        "Who is in Charge of Sector Reports?"
      ],
      "responses": [
        "To advise the government and other public procurement organs on the policies, strategies and organization of public procurement; To monitor activities of public contract award and execution.or visit www.rppa.gov"
      ]
    },
    
    {
      "tag": "principles",
      "patterns": [
        "What are the principles of public procurement in Rwanda?",
        "Where do you get Radiation Protection?",
        "What is the link to the Radiation Protection?",
        "How do you get Radiation Protection?",
        "Who is in Charge of Radiation Protection?"
      ],
      "responses": ["As part of public financial management reforms, the Government of Rwanda has been engaged in a number of initiatives aimed at streamlining its public procurement system in order to align it with fundamental principles of transparency, competition, economy, effective, efficient and fast work, fairness and accountability"
      ]
    },
    
    {
      "tag": "Services",
      "patterns": [
        "Guide me to Services?",
        "Where do you get Services?",
        "What is the link to the Services?",
        "How do you get Services?",
        "Who is in Charge of Services?"
      ],
      "responses": [
        "You can use this link <a href =\"https://rura.rw/index.php?id=251\" target=\"_blank\">here</a> for more information"
      ]
    },
    {
      "tag": "in full",
      "patterns": [
        "What does RPPA stand for?",
        "Where do you get Law Governing Radiation protection?",
        "What is the link to the Law Governing Radiation protection?",
        "How do you get Law Governing Radiation protection?",
        "Who is in Charge of Law Governing Radiation protection?"
      ],
      "responses": [
        "Reduced Pressure Principle Assembly (RPPA)"
      ]
    },
    {
      "tag": "challenges",
      "patterns": [
        "What are the challenges of public procurement in Rwanda??",
        "Where do you get Regulations and Guidelines?",
        "What is the link to the Regulations and Guidelines?",
        "How do you get Regulations and Guidelines?",
        "Who is in Charge of Regulations and Guidelines?"
      ],
      "responses": [
        "Some the challenges included: inconvenient business registration; inaccurate management information & analytics; lack of one-stop procurement portal; and inefficient document and records management system"
      ]
    },
   
  
  
  
    {
      "tag": "All Online Services",
      "patterns": [
        "Guide me to All Online Services?",
        "Where do you get All Online Services?",
        "What is the link to the All Online Services?",
        "How do you get All Online Services?",
        "Who is in Charge of All Online Services?"
      ],
      "responses": [
        "The E-Procurement System automates the public procurement process and enables the interactions of… Read more → · Explore More. Latest news ...You've visited this page 2 times. Last visit: 2/6/23https://www.rppa.gov.rw › services"
      ]
    }
  ]
}
  ]
}